import re
import sys

PAIRS = [("ñ","॰"),("Q+Z","QZ+"),("sas","sa"),("aa","a"),("¼Z","र्द्ध"),("ZZ","Z"),("å","०"),("ƒ","१"),("„","२"),("…","३"),("†","४"),("‡","५"),("ˆ","६"),("‰","७"),("Š","८"),("‹","९"),("¶+","फ़्"),("d+","क़"),("[+k","ख़"),("[+","ख़्"),("x+","ग़"),("T+","ज़्"),("t+","ज़"),("M+","ड़"),("<+","ढ़"),("Q+","फ़"),(";+","य़"),("j+","ऱ"),("u+","ऩ"),("Ùk","त्त"),("Ù","त्त्"),("ä","क्त"),("–","दृ"),("—","कृ"),("é","न्न"),("™","न्न्"),("=kk","=k"),("f=k","f="),("à","ह्न"),("á","ह्य"),("â","हृ"),("ã","ह्म"),("ºz","ह्र"),("º","ह्"),("í","द्द"),("{k","क्ष"),("{","क्ष्"),("f=","त्रि"),("=k","त्र"),("«","त्र्"),("Nî","छ्य"),("Vî","ट्य"),("Bî","ठ्य"),("Mî","ड्य"),("<î","ढ्य"),("|","द्य"),("K","ज्ञ"),("}","द्व"),("J","श्र"),("Vª","ट्र"),("Mª","ड्र"),(">ª","ढ्र"),("Nª","छ्र"),("Ø","क्र"),("Ý","फ्र"),("nzZ","र्द्र"),("æ","द्र"),("ç","प्र"),("Á","प्र"),("xz","ग्र"),("#","रु"),(":","रू"),("v‚","ऑ"),("vks","ओ"),("vkS","औ"),("vk","आ"),("v","अ"),("b±","ईं"),("Ã","ई"),("bZ","ई"),("b","इ"),("mQ","ऊ"),("m","उ"),("Å","ऊ"),(",s","ऐ"),(",","ए"),("½","ऋ"),("ô","क्क"),("d","क"),("Dk","क"),("D","क्"),("£","र्f"),("[k","ख"),("[","ख्"),("x","ग"),("Xk","ग"),("X","ग्"),("Ä","घ"),("?k","घ"),("?","घ्"),("³","ङ"),("p","च"),("Pk","च"),("P","च्"),("N","छ"),("”k","ज"),("”","ज्"),("t","ज"),("Tk","ज"),("T","ज्"),(">","झ"),("÷","झ्"),("¥","ञ"),("ê","ट्ट"),("ë","ट्ठ"),("V","ट"),("B","ठ"),("ì","ड्ड"),("ï","ड्ढ"),("M","ड"),("<","ढ"),(".k","ण"),(".","ण्"),("r","त"),("Rk","त"),("R","त्"),("Fk","थ"),("F","थ्"),("n","द"),("/","ध"),("èk","ध"),("è","ध्"),("Ë  ","ध्"),("u","न"),("Uk","न"),("U","न्"),("iQ","फ"),("i","प"),("Ik","प"),("I","प्"),("¶","फ्"),("c","ब"),("Ck","ब"),("C","ब्"),("Hk","भ"),("H","भ्"),("e","म"),("Ek","म"),("E","म्"),(";","य"),("¸","य्"),("j","र"),("y","ल"),("Yk","ल"),("Y","ल्"),("G","ळ"),("oQ","क"),("o","व"),("Ok","व"),("O","व्"),("'k","श"),("'","श्"),("Ük","श"),("Ü","श्"),('"k',"ष"),('"',"ष्"),("l","स"),("Lk","स"),("L","स्"),("g","ह"),("È","ीं"),("z","्र"),("Ì","द्द"),("Í","ट्ट"),("Î","ट्ठ"),("Ï","ड्ड"),("Ñ","कृ"),("Ò","भ"),("Ó","्य"),("Ô","ड्ढ"),("Ö","झ्"),("¼","द्ध"),("Ú","फ्र"),("É","ह्न"),("Ů","त्त्"),("Ľ","द्ध"),("˝","ऋ"),("Ř","क्र"),("Ń","कृ"),("Q","फ़"),("č","ध्"),("Ş","्र"),("‚","ॉ"),("¨","ो"),("ks","ो"),("©","ौ"),("kS","ौ"),("k","ा"),("h","ी"),("q","ु"),("w","ू"),("`","ृ"),("s","े"),("¢","े"),("S","ै"),("a","ं"),("¡","ँ"),("ˇ","ँ"),("%","ः"),("W","ॅ"),("•","ऽ"),("·","ऽ"),("∙","ऽ"),("+","़"),("\\","?"),("‘",'"'),("’",'"'),("“","'"),("^","‘"),("*","’"),("Þ","“"),("ß","”"),("¾","="),("&","-"),("μ","-"),("¿","{"),("À","}"),("A","।"),("Œ","॰"),("]",","),("@","/"),(" ः",":"),("~","्"),("्ा",""),("ाे","ो"),("ाॅ","ॉ"),("अौ","औ"),("अो","ओ"),("आॅ","ऑ")]


def replace_symbols(text):
    if not text:
        return text

    text = re.sub(r'([ZzsSqwa¡`]+)Q', r'Q\1', text)

    for old, new in PAIRS:
        while old in text:
            text = text.replace(old, new)

    text = re.sub(r'([ेैुूं]+)्र', r'्र\1', text)
    text = re.sub(r'ं([ाेैुू]+)', r'\1ं', text)
    text = re.sub(r'([ \n])ा', r'\1श', text)

    text = text.replace('¯', 'f')
    text = text.replace('Ł', 'र्f')

    text = re.sub(r'([fŻ])([कखगघङचछजझञटठडड़ढढ़णतथदधनपफबभमयरलवशषसहक्ष])', r'\2\1', text)
    text = re.sub(r'([fŻ])(्)([कखगघङचछजझञटठडड़ढढ़णतथदधनपफबभमयरलवशषसहक्ष])', r'\2\3\1', text)
    text = re.sub(r'([fŻ])(्)([कखगघङचछजझञटठडड़ढढ़णतथदधनपफबभमयरलवशषसहक्ष])', r'\2\3\1', text)

    text = text.replace('f', 'ि')
    text = text.replace('Ż', 'िं')

    text = text.replace('±', 'Zं')
    text = re.sub(r'([कखगघचछजझटठडड़ढढ़णतथदधनपफबभमयरलळवशषसहक्षज्ञ])([ािीुूृेैोौंँ]*)([Z])', r'\3\1\2', text)
    text = re.sub(r'([कखगघचछजझटठडड़ढढ़णतथदधनपफबभमयरलळवशषसहक्षज्ञ])([्])([Z])', r'\3\1\2', text)
    text = text.replace('Z', 'र्')

    return text


def chanakya_to_unicode(text, chunk_size=6000):
    result = []
    for i in range(0, len(text), chunk_size):
        result.append(replace_symbols(text[i:i + chunk_size]))
    return ''.join(result)

# Reverse table
REVERSE_PAIRS = sorted(
    [(u, c) for c, u in PAIRS],
    key=lambda x: len(x[0]),
    reverse=True
)


def unicode_to_chanakya(text):
    if not text:
        return text

    text = re.sub(
        r'र्([कखगघचछजझञटठडड़ढढ़णतथदधनपफबभमयरलळवशषसहक्षज्ञ])([ािीुूृेैोौंँ]*)',
        r'\1\2Z',
        text
    )

    text = text.replace("िं", "Ż")

    text = re.sub(
        r'([कखगघङचछजझञटठडड़ढढ़णतथदधनपफबभमयरलवशषसहक्षज्ञ])ि',
        r'f\1',
        text
    )

    text = re.sub(
        r'([्])([कखगघङचछजझञटठडड़ढढ़णतथदधनपफबभमयरलवशषसहक्षज्ञ])ि',
        r'f\1\2',
        text
    )

    text = text.replace("Ż", "fं")
    for uni, ch in REVERSE_PAIRS:
        text = text.replace(uni, ch)

    return text

if __name__ == '__main__':
    text = input("Enter Chanakya Text:")
    print(chanakya_to_unicode(text))